require("ai.ai")

function OnStartOfDuel()
	AI.Chat("BOSS AI")
	local d=Duel.GetFieldGroup(0, LOCATION_DECK,0)
	local dc=d:GetFirst()
	local e1=Effect.CreateEffect(dc)
    e1:SetType(EFFECT_TYPE_CONTINUOUS+EFFECT_TYPE_FIELD)
    e1:SetCode(EVENT_ADJUST)
    e1:SetOperation(function(e,tp,eg,ep,ev,re,r,rp)
OnStartOfDuel_Boss()
		e:Reset()
	end)
	Duel.RegisterEffect(e1,1)
end

function OnStartOfDuel_Boss()
if player_ai~=nil then 
		EnableCheats2(TokenList)
		return
	end
	local cheat1=EnableCheats
	local cheat2=EnableCheats2
	local list=TokenList
	EnableCheats=function ()
		cheat1()
		cheat2(list)
	end
	local savc=SaveCards
	SaveCards=function()
		if player_ai==nil then 
			player_ai=1
			playersetupcomplete = true
			EnableCheats()
		end		
		savc()
	end
	GlobalCheating = 1

	----------------
end

function EnableCheats2(list)
  local e1=Effect.GlobalEffect()
  e1:SetType(EFFECT_TYPE_CONTINUOUS+EFFECT_TYPE_FIELD)
  e1:SetCode(EVENT_PHASE+PHASE_DRAW)
  e1:SetCountLimit(1)
  e1:SetCondition(function(e,tp,eg,ep,ev,re,r,rp)
    return Duel.GetTurnPlayer()==player_ai
  end)
  e1:SetOperation(function(e,tp,eg,ep,ev,re,r,rp) 
	local tc=Duel.CreateToken(player_ai,list[math.random(#list)])
	local tccode=tc:GetOriginalCode()
	if tc:IsType(TYPE_MONSTER) and tc:IsCanBeSpecialSummoned(e,TokenSumType[tccode],player_ai,true,true) then
		if not TokenSumType[tccode] then TokenSumType[tccode]=0 end
		Duel.SpecialSummon(tc,TokenSumType[tccode],player_ai,player_ai,true,true,POS_FACEUP_ATTACK)
		tc:SetStatus(STATUS_PROC_COMPLETE,true)
		if ExpansionCheating[tccode] then 
			ExpansionCheating[tccode](tc)
		else
			ExpansionCheating[bit.band(tc:GetType(),TYPE_XYZ)](tc)
		end
		return
	end
	if tc:IsType(TYPE_SPELL+TYPE_TRAP) and Duel.GetLocationCount(player_ai,LOCATION_SZONE)>0 then
		Duel.MoveToField(tc,player_ai,player_ai,LOCATION_SZONE,POS_FACEDOWN,true)
		return
	end
  end)
  Duel.RegisterEffect(e1,player_ai)
end
--[[
TokenList={
	62873545,99267150,35952884,97836203,97489701,
	24696097,  ---   流星龙
	52687916   ---   三叉
}
]]
TokenSumType={
	[52687916]=SUMMON_TYPE_SYNCHRO
}

ExpansionCheating={
	[0]=aux.NULL,
	[24696097]=function (tc)
		tc:ResetEffect(24696097,RESET_CARD)
		local f1=c24696097.mtop
		c24696097.mtop=function(e,tp,eg,ep,ev,re,r,rp)
			local cheatg=Group.FromCards(Duel.CreateToken(player_ai,40348946),Duel.CreateToken(player_ai,14943837),Duel.CreateToken(player_ai,97268402),Duel.CreateToken(player_ai,63977008),Duel.CreateToken(player_ai,96182448))
			local cheatc=cheatg:GetFirst()
			while cheatc do
				Duel.Remove(cheatc,POS_FACEUP,REASON_RETURN)
				Duel.SendtoDeck(cheatc,tp,0,REASON_RETURN)
				cheatc=cheatg:GetNext()
			end
			local f2=Duel.ConfirmDecktop
			Duel.ConfirmDecktop=function(player,count)			
				local dtg=Duel.GetDecktopGroup(player,count)
				local dtc=dtg:GetFirst()
				while dtc do
					Duel.Hint(HINT_CARD,1-player_ai,dtc:GetOriginalCode())
					dtc=dtg:GetNext()
				end
				f2(player,count)
			end
			f1(e,tp,eg,ep,ev,re,r,rp)
			Duel.ConfirmDecktop=f2
			Duel.DisableShuffleCheck()
			Duel.Remove(cheatg,POS_FACEDOWN,REASON_RETURN)
		end
		c24696097.initial_effect(tc)
		c24696097.mtop=f1
	end,
	[TYPE_XYZ]=function(tc)
		local cheatg=Group.FromCards(Duel.CreateToken(player_ai,13647631),Duel.CreateToken(player_ai,15341821),Duel.CreateToken(player_ai,28884172))
		Duel.Remove(cheatg,POS_FACEDOWN,REASON_RETURN)
		Duel.Overlay(tc,cheatg)
	end
}

TokenList={
--8星通常怪兽列表（攻击高于守备）
32626733,
38999506,
39111158,
39674352,
65957473,
76232340,
89631139,
89631140,
89631141,
89631142,
89631143,
89631144,
95788410,
--7星通常怪兽列表（同上并且2500攻击以上）
24311372,
31447217,
42129512,
89189982,
46986419,
--融合怪兽
62873545, --究极龙骑士
1546123, --电子终结龙
23995346,--青眼究极龙
12652643,--古代的机械究极巨人
74157028,--电子双生龙
14017402,--波动龙骑士
29343734,--元素英雄 永生侠
40101111,--究极念动力体
56655675,--圣灵兽骑 地火狮
99916754,--自然木龙兽
10817524,--始祖龙 古龙
11901678,--暗黑魔龙
17032740,--元素英雄 混沌新宇侠
27134689,--OZ之主
49352945,--元素英雄 风暴新宇侠
78512663,--元素英雄 熔岩新宇侠
5128859,--元素英雄 海洋新宇侠
6602300,--重爆击禽 炸弹不死魔鸟
8692301,--宝石骑士·仿钻
25366484,--元素英雄 闪光火焰翼侠
36256625,--超级交通机人-巨大钻头
29357956,--剑斗兽 尼禄
60493189,--元素英雄 电离钳侠
62624486,--假面英雄 宝钻
68745629,--元素英雄 爆裂火焰侠
72378329,--野兽眼灵摆龙
58601383,--地天之骑士
83866861,--狂乱米拉
75380687,--咒符龙
54702678,--机王
43378048,--混沌幻魔
86346643,--虹光新宇侠
76263644,--D 终
84243274,--神龙炮
8198620,--冥界龙
74711057,--元素英雄 地球侠
83121692,--元素英雄 暴风侠
85520851,--超传导恐兽

86676862,--邪心英雄 恶刃魔王
88820235,--元素英雄 闪光凤凰人
90660762,--流星黑龙
91998119,--XYZ-神龙炮

--仪式怪兽
66729231,--魂魄巨灵
64631466,--纳祭之魔
5405694,--混沌战士
26932788,--标枪甲虫
30208479,--黑混沌之魔术师
46427957,--破灭之女神 露茵
49064413,--假面魔兽 地狱修道士
62420419,--大邪神 雷瑟夫
69123138,--杰拉
72426662,--终焉之王 迪米斯
86327225,--天界王 志那都
91782219,--蟹龟
97642679,--暗之支配者-佐克








--同调怪兽
35952884,--流天类星龙
97489701, --红莲新星龙
67030233,--救世魔龙
8763963,--魔王超龙 天蝇王
9888196,--正义盟军 决战兵器
39477584,--魔轰神 利威坦
51447164,--科技属 刃枪手
21435914,--冥界浊龙 龙叹
74892653,--星尘战士
16527176,--自然狮面草
24221808,--精神超载恶魔
50278554,--废铁双生龙
52352005,--XX-剑士 加特姆士
69461394,--正义盟军 陆军元帅
95526884,--超念力枪手
23693634,--巨人斗士
25132288,--光辉终结龙
25165047,--生命激流龙
30757396,--血魔 墨非斯特
34408491,--魔王龙 蝇王
39823987,--太阳龙 因蒂
54048462,--魔轰神 瓦尔基鲁斯
60992105,--玄翼龙 黑羽
61231400,--炎神机-紫龙
45037489,--鲜花骑士
93483212,--奥丁
7841112,--救世星龙
30604579,--托
67098114,--洛基
40908371,--苍眼银龙
59969392,--骸骨恶魔
66165755,--盟军·次世代加速人
69514125,--神圣骑士 珀耳修斯
70780151,--精神界恶魔
72896720,--永火死亡龙
73483491,--真次世代风筝
75779210,--艾普西龙大日
76774528,--废铁龙
81020646,--炼狱龙 食人魔龙鬼
88643579,--暗黑终结龙
95453143,--百眼龙
96029574,--黑兽龙




--超量怪兽
--49202331,--混沌超量 超巨大空中要塞 宝比伦号
--3814632,--超巨大空中宫殿 钟声协和号
--32559361,--混沌No.9 天盖妖星 混沌戴森球
--49032236,--No.81 超重型炮塔列车 优越多拉炮
--51543904,--No.99 希望皇龙 霍普德拉古恩
--56910167,--超重型炮塔列车 古斯塔夫最大炮
--66523544,--超次元机器人 银河破坏王
--1992816,--No.9 天盖星 戴森球
--33776843,--混沌No.15 机关傀儡-连环杀手
--58820923,--暗物质龙
--69170557,--混沌No.40 机关傀儡-魔界弦乐手
--95113856,--幻子力空母 进取神船号
--97403510,--No.92 伪骸神龙 心地心龙
--698785,--雷霆终结龙
--88754763,--热血教练
--6165656,--命运狮子
--41147577,--风纪大官司
--30741334,--热血指导王 巨人教练
--36405256,--银河眼 重铠光子龙
--39272762,--超银河眼光子龙
--73445448,--No.22 不乱健
--75433814,--No.40 机关傀儡-天堂弦乐手
--77799846,--废品眼太鼓龙
--88120966,--No.15 机关傀儡-巨人杀手
--88177324,--No.107 银河眼时空龙






--灵摆怪兽
47198668,--死伟王
74069667,--DDD 坏薙王 深渊末日神







--效果怪兽
4779091,--于贝尔-被憎恶的骑士
15013468,--斯芬克斯·安德鲁
15574615,--异次元喷气机·大铁号
21208154,--邪神 神之化身
32240937,--绝对服从魔人
38898779,--巨人斗士/爆裂体
51126152,--深夜急行骑士
51402177,--斯芬克斯·迪蕾雅
55690251,--堕天使 迪赛尔
57793869,--邪神 抹灭者
60417395,--暗冥天魔 尼奥斯菲亚
61257789,--星尘龙/爆裂体
69890967,--幻魔皇 拉比艾尔
77336644,--红莲魔龙/爆裂体
79407975,--究极宝玉神 虹暗龙
79856792,--究极宝玉神 虹龙
14553285,--奥金魔术师/爆裂体
92377303,--黑衣大贤者
96561011,--真红眼暗龙
3117804,--超重武者 大弁庆-K
10026986,--异虫王
10526791,--元素英雄 锯齿荒野侠
10532969,--古代鲨 超巨齿鲨
13959634,--冰灵神 穆兰格雷斯
14258627,--地球巨人
15894048,--究极恐兽
16886617,--爬虫妖女·和修吉
17132130,--命运英雄 教义人
18891691,--完美机械王
19028307,--兽神机王 巴巴罗斯乌尔
22056710,--吸血鬼创世主
23015896,--炎王神兽 大鹏不死鸟
24857466,--冥王龙 断罪神
33655493,--暗之侯爵 贝利亚
35803249,--人造人-念力王者
35842855,--炎灵神 派罗雷克斯
36405256,--时花之魔女
40737112,--混沌之黑魔术师
41753322,--龙脚兽 腕龙
45458027,--上弦式神
48453776,--天魔神 诺雷拉斯
49217579,--幻影之骑士
50705071,--金属恶魔 佐亚
50933533,--古代的机械巨龙
53027855,--风灵神 温德罗斯
53183600,--青眼卡通龙
55735315,--魂食神龙 吸灵龙
56647086,--暗黑之侵略者
57610714,--云魔物-台风眼
61441708,--奈芙提斯之凤凰神
61468779,--地灵神 格兰索尔
64335804,--真红眼黑铁龙
66214679,--暗黑黑炎龙
66789970,--圣刻龙-塞特龙
66973070,--死镰杀手
67136033,--热血兽王 熊人
67675300,--雪尘龙

72258771,--核成魔神 华拉法
72634965,--虚无之统括者

72989439,--混沌战士 -开辟的使者-
73333463,--战甲机人 铠电合
76039636,--恶魔铲土虫
77498348,--混沌战士 -宵暗的使者-

78540593,--姬葵 玛丽娜
81146288,--大凛魔天使 蔷薇仙
81254059,--异虫女王
82301904,--混沌帝龙 -终焉的使者-
83104731,--古代的机械巨人
86489182,--始祖神鸟 斯摩夫
85605684,--狂暴死龙
87294988,--红姬 知流姬
92719314,--暗黑创世神
95701283,--光神机-轰龙
98229575,--U.A.组织核心










10000020, --天空龙
75347539,--磁石战士
25833572,--门之守卫
53347303,--青眼光龙
62180201,--邪神 恐惧之源
63519819,--千眼纳祭神
37169670,--超念力枪手/爆裂体
87997872,--斯芬克斯
5126490,--新宇贤者
51402908,--至尊太阳
85028288,--侏罗纪巨神兽
82556058,--魔机马达
34004470,--大土星
3954901,--闪耀巨龙
16898077,--轰炸机
5861892,--暗之支配者
69831560,--光之支配者
32491822,--哈蒙
14466224,--大气圈神鸟
48579379,--大飞蛾
63468625,--机皇神
31764700,--悲伤魔龙
59464593,--LV10
29436665,--黑魔导执行官
44910027,--胜利龙
94092230,--侵入魔人
58054262,--机甲武装
80208158,--罗宾
72443568,--沉默的魔术师
65026212,--核成巨龙
85771019,--堕天使
32543380,--火山恶魔
68811206,--伟大的战士
53199020,--魔轰神
16191953,--吉格大王
61505339,--创世神
31829185,--暗黑人偶
97811903,--清净恶龙
98585345,--栗子球10
93709215,--暗冥破坏神
69933858,--传说的战士 吉尔福德
71200730,--出于黑暗的绝望
71438011,--正义盟军 雷铠兵
93717133,--银河眼光子龙

94568601,--暴君龙
99899504,--骷髅炎鬼





--灵魂怪兽
75745607,--火之迦具土
76862289,--八娱大蛇


--二重怪兽
69488544,--凤凰剑圣 基亚·弗里德


	
	

	

--我加的
24696097,  ---   流星龙
52687916, ---   三叉
--通常魔法
	74825788,--火热之心
	1036974,--不幸
	5556668,--手札兑换
	5758500,--魂之解放
	7165085,--诱饵人偶
	10248192,--圣书体石板
	11868825,--哥布林的迷药
	15866454,--喧闹的邪恶
	17449108,--扑灭
    12923641,--护封剑
	19523799,--大火灾
	20264508,--漏雷
	20871001,--蓝色药剂
	22346472,--破天荒之风
	24096228,--二重魔法
	24294108,--燃烧的大地
	33423043,--异次元的殖
	33767325,--死亡流星
	33782437,--一时休战
	36484016,--奇迹同调融合
	37520316,--精神
	37812118,--圣杯
	38199696,--红色药
	38723936,--谜题
	40350910,--癔症
	42703248,--飓风
	43422537,--二重召唤
	43434803,--墓穴
	43661068,--许愿
	47852924,--鲜血
	48642904,--催眠术
    50427388,--暴走的魔力
	51790181,--无欲之壶
	52097679,--攻守交换
	52112003,--卡片升级
	52263685,--偷窥者
	53129443,--黑洞
	56260110,--雷鸣
	57902193,--苦涩的转生
	58074572,--咖喱
	58577036,--推理
	58775978,--铁栏
	60398723,--森林的沙沙作响
    72302403,--护封剑
	72767833,--卡片反转
	73134081,--火刑
    81510157,--灵魂捕获
	81000306,--浑身一击
	81820689,--密探
	97169186,--地碎
	99004752,--迷你胆识
	99518961,--革命
	
	
	
	
	
	--速攻魔法
	5318639,--旋风
	8842266,--毒药
	25789292,--圣杯
	27243130,--圣枪
	52497105,--蛮勇鳞粉
    74137509,--天使骰子
	96864811,--圣衣
	
	
	
	
	--永续魔法
	10012614,--勇气的旗印
	11961740,--时间胶囊
	16762927,--守墓的使徒
	17626381,--补给
	32835363,--永续魔法
	33904024,--强欲的碎片
	35059553,--斗技场
	41482598,--噩梦
	44947065,--强者的
	45141013,--大热波
	45311864,--哥布林盗贼
	45895206,--消除黑暗的光
	46130346,--火球
	46918794,--火焰地狱
	47233801,--黑蛇病
	48712195,--卡片商人
	51481927,--魔法吸收
	54631834,--终端世界
    62966332,--天地变异
	66719324,--恩惠之雨
	66788016,--地割
	69162969,--闪电漩涡
	70368879,--哥布林爆发
	70828912,--埋葬

	75500286,--柜子
	76103675,--火星
	76754619,--金字塔能量
	76895648,--危险机器
	79323590,--魔力之枷
	82003859,--通行税
	82257940,--礼物交换
	82542267,--掘墓
	82828051,--地震
	84257639,--治疗
	88369727,--愚蠢的转生
	89882100,--夜摄
	93238626,--玉座
	94163677,--无限宝札
	95220856,--怨灵的湿地
	95308449,--倒计时
	
	
	--装备魔法
	23842445,--硝化装备
    71453557,--自律
	70828912,--埋葬
	--场地魔法
	95376428,--额外之网
	
	-----
	-----
	--通常陷阱
	126218,--恶魔骰子
	2055403,--时空的落穴
	2122975,--陷阱捕获
	2130625,--白衣天使
	4206964,--落穴
	4440873,--强力的打落
	4923662,--混沌炸裂
	6799227,--半反击
	7076131,--消失的后者
    9267769,--闪光弹
	12197543,--剑之指挥
	12607053,--和睦的使者
	12863633,--五棱星
	15552258,--一半或停止
	15684835,--邪心爆破
	15800838,--心灵崩坏
	16674846,--气魄之力
	18252559,--内置式爆弹
	18807108,--六芒星的咒缚
	20721759,--仇恨裂缝
    21636650,--奇迹之残照
	22047978,--战斗终止
	23122036,--阴谋之盾
	24068492,--自业自得
	24268052,--防卫障壁
	24623598,--失落
	24673894,--改变命运
	25005816,--鼓舞
	25050038,--连锁治愈
	25642998,--波塞冬之浪
	26533075,--保安求
	27053506,--机枪
	29590905,--超级少年组
	30155789,--肆虐性媚药
	30461781,--八尺鸟
	30488793,--反弹力
	30643162,--强袭冲击
	31000575,--征兵令
	31077447,--吓人箱
	33248692,--子机猎手
	34002992,--虹之生命
	34149830,--死力的组队换手
	35268887,--暗之刻印
	35316708,--伤害转化
	35346968,--神之恩惠
	36361633,--威吓之咆哮
	37383714,--魂之纲
	37390589,--回力镖
	37576645,--无谋的贪欲
	38299233,--刺墙
	38411870,--吊顶
	41398771,--咀咒
	43250041,--吸收盾
	48135190,--砂石飓风
	49998907,--平庸鬼的研究成果
	50243722,--爆裂埋伏
	50470982,--命运的分岔道
	51394546,--公墓炸弹
	51449743,--连锁爆破
	55773067,--打落
	56120475,--炸裂装甲
	56916805,--能量吸收
	57270476,--来自墓场的引诱
	58015506,--绒儿的读心术
	58169731,--分断之壁
	59344077,--魔力抽取
	59560625,--换位
	59744639,--伊塔库亚的暴风
	60080151,--好对手的记忆
	60082869,--沙尘之大龙卷
	60621361,--夺骨苏生
	60743819,--恶魔的叹息
	61705417,--盗墓者
	62325062,--黏着的落穴
	63356631,--凤翼的爆风
	63442604,--物理分身
	63571750,--皇家的财宝
	63689843,--白兵战
	65743242,--地缚灵的引诱
	65824822,--暗之取引
	66518841,--自尊的咆哮
	69724380,--魔之取引
	70342110,--次元幽闭
	71098407,--健忘
	71587526,--因果切断
	72885174,--命运旅行
	73632127,--次元崩落
	73872164,--家破人亡
	73729209,--技能继承
	74458486,--援护射击
	75392615,--心灵透视
	75987257,--隶属鳞粉
	76137276,--魔法捕获
	76848240,--绝对不可侵领域
	77462146,--幻影骑士团 影佑
	77754944,--万能地雷 阔剑式
	79161790,--反转世界
	79544790,--悔恨复活
	80036543,--对活路的希望
	81172176,--恶魔喜剧演员
	81210420,--魔术礼帽
	83133491,--重力解除
	83968380,--强欲之瓶
    86871614,--克隆复制
	87772572,--量子猫
	88279736,--哥布林拦路贼
	92219931,--二者一两损
	93599951,--沉默的邪恶灵
	94156050,--颠倒眼镜
	95448692,--伤害瘦身
	96008713,--魔术臂盾
	96355986,--神圣标枪
    98239899,--附锁链的爆弹
	98299011,--圣精灵的祝福
	98427577,--废铁稻草人
	98535702,--伤害疫苗ΩMAX
	
	
	
	
	--永续陷阱
	3129635,--咀咒之像
	4869446,--沙漠的裁决
    8951260,--正正堂堂
	13955608,--要塞
	18634367,--红莲屏障
	21598948,--怪兽箱
	23626223,--库纹样的图像
	26905245,--粘土
	27062594,--命运之门
	28378427,--伤害电容器
	28649820,--化神
	29267084,--暗之咒缚
	31863912,--指出出目
	39122311,--龙魂之幻泉
	39131963,--死亡反击
	39537362,--旅人的试练
	46502013,--妖精轮
	48276469,--连锁炸药
	49587034,--光之封札剑
	49514333,--灵魂之像
	50277973,--沼泽镜像者
	50323155,--升天之黑角笛
	52140003,--爆弹海胆
	52503575,--最终突击命令
	53239672,--灵魂障壁
	53656677,--力量框架
	54704216,--拷问车轮
	54976796,--等级限制A地区
	56995655,--不吉的占卜
	65830223,--卖棺者
	68875140,--哥布林推销员
	70406920,--机械王-B.C.3000
	77910045,--死之演算盘
	79852326,--死灵佐玛
    81489939,--魔人之歌
	83258273,--僵尸拦路贼
	90440725,--电子暗影守卫者
	91781589,--霸者的独揽
	92099232,--变形人姐妹
	94374859,--僵尸推销员
	97232518,--深渊的电击魟
	97077563,--活死人的呼声
	
	
	
	
	
	--反击陷阱
	14315573,--攻击无力化
	77538567,--魔宫的贿赂
}