昨天没能见到你真是遗憾。
昨日はお会いできなくて残念でした。



我向他打招呼可他却没理我。
彼に声をかけたのに，無視された。



少女出神地看着那个青年。
少女はうっとりしたまなざしで青年を見た。



这个房间的空调噪音很大。
部屋のエアコンがうるさい。



这〔那〕包是外国货吧？
かばん，外国製でしょう？



这〔那〕什么牌啊？
どこのメーカーの？



这〔那〕是不是你画的？
きみがかいた絵でしょう？



口袋里有一个钱包。
ポケットには財布が入っている。



书架上有很多书。
本棚にたくさん本があります。



啤酒在冰箱里。
ビールは冷蔵庫にある。



把暖水瓶里的水倒出去。
ポットの水をあけてください。



他把他的理论应用到实践中去。
彼は理論を実践に生かした。



胸前戴着徽章。
胸にバッジをつける。



屋子里有很多家具。
部屋にはたくさんの家具がある。



我的自行车放在他那儿。
自転車は彼に預かってもらっている。



我妈妈是公司职员。
母は会社員である。



你女儿多大了？
お嬢さんはいくつですか。



你父母都好吗？
ご両親はお元気ですか。



小王跟他妻子回老家了。
王さんは妻と実家に帰った。



我表妹明年去中国留学。
従妹いとこは来年中国に留学に行きます。



我们老师今年刚大学毕业。
先生は大学を出たばかりです。



过一会儿就好了。
少したてば（すぐ）よくなります。



再过一个小时天就亮了。
1時間もすれば（もう）夜があける。



现在就死心，还为时过早。
今（すぐ）あきらめるのは時期尚早である。



调查组明天就出发。
調査班は明日には（もう）出発する。



他五岁时就会弹钢琴。
彼は5歳のときには（もう）ピアノが弾けた。



他一回到家就洗澡。
彼は家に帰ると（すぐ）おふろに入る。



听了那消息以后，我就放心了。
それを聞いて安心した。



吃了这药，病就会好的。
この薬をのめばよくなります。



“谁是小赵？”“圆脸的就是小赵。”
「どの人が趙くんですか」「顔の丸い人が趙くんです」。



“请问，王先生在吗？”“我就是，您哪位？”
「すみません，王さんはいらっしゃいますか」「私ですが，どちらさまですか」。



你说的对！就这么办吧。
きみの言うとおりだ！そうしよう。



不买，不买，我就不买。
買わない，買わない，絶対買わない。



不管别人说什么我都不在乎，我就喜欢吃这个菜。
人がどう言おうと気にしない，ぼくはこの料理が好きだ。



昨天和今天都很热。
昨日も今日も暑い。



他和小王都去东京了。
彼も王くんも東京へ行った。



我每年都去中国。
私は毎年中国に行きます。



家家都有一本难念的经。
どの家にも人に言えない苦労はあるものだ。



我身体很好，检查不检查都一样。
私は健康だから，検査してもしなくても同じです。



满脑子都只想着考试的事。
頭の中は試験のことでいっぱいだ。



穿这么少要着凉的。
そんなに薄着だと風邪をひきますよ。



不学习就要落后。
勉強しなければすぐにおくれてしまう。



听了您的话，我才省悟了。
お話を聞いて（はじめて）目がさめました。



他才适合当市长。
彼（こそ）が市長にふさわしい。



那儿的风景才美呢。
あそこの景色はほんとにすばらしい。



会议开始好长时间了，他才露面。
会議が始まってずいぶんたってから，彼は（やっと）顔を出した。



正是因为下了苦功，才创作出了好作品。
苦労したから（こそ）いい作品ができた。



等了十分钟。
10分間待った。



看了两个小时（的）电视。
2時間テレビを見た。



等了他半天。
彼を長いこと待った。



他毕业三年了。
彼は卒業して3年になる。



我结婚四年了。
結婚して4年になる。



她的演唱会，我去听过两次。
彼女のコンサートに，私は2回行ったことがある。



他每天给他妈妈打一次电话。
彼はお母さんに毎日1度電話を入れる。



他上课之前看了三遍课文。
彼は授業の前にテキストを3回読んだ。



爸爸拍了两下大腿。
父はひざをポンポンとたたいた。



老王上午来看过我一次。
王さんは午前中に1度私を訪ねてきた。



(a)我去过西安一次。。
西安に1度行ったことがある。



(a)我见过小王一次。
王さんに1度会ったことがある。



妹妹比我高一个头。
妹は私より頭1つ背が高い。



这件毛衣比那件贵50元。
このセーターはあれより50元高い。



今天的气温比昨天低十度左右。
今日は気温が昨日より10度くらい低い。



我来讲几句。
一言ごあいさつを申しあげます。



我来按顺序介绍一下事情的经过。
順序を追って事の次第をお話しいたします。



他写惯这种文章，就让他来写吧。
彼はその種の文章を書きつけているから，彼に頼もう。



自己的工作自己去考虑。
自分の裁量で仕事を進める。



我们来比比谁的力气大。
力比べをしよう。



靠运动来消耗脂肪。
運動して脂肪を減らす。



你应该根据自己的收入去生活。
収入に応じた暮らしをしなさい。



我要按自己想的去做。
自分の気持ちに正直でありたい。



集中全部的力量去斗争。
総力を結集してたたかう。



他用甜言蜜语来哄妈妈。
彼は舌先で母親を丸めこんだ。



我母亲年轻时很漂亮。
私の母は若いころきれいだった。



啊，真好吃。
ああ，おいしかった。



去年夏天，天气很凉快。
去年の夏は涼しかった。



我小时候很活泼。
子どものころはとてもおてんばでした。



他在外边等了她两个小时了。
彼は外でガールフレンドを2時間待っていた。



我整整干了八个钟头了。
私はもうまるまる8時間働いている。



下午我在图书馆学习了一个小时。
午後は図書館で1時間勉強をしていた。



那只鸟已经死了。
その鳥は死んでいる。



教她拉小提琴。
彼女にバイオリンを教えてあげる。



他吃坏了肚子。
彼はおなかをこわした。



脚上磨出了泡。
足にまめができた。



箭射中了靶子。
矢が的にあたった。



他走进教室去了。
彼は教室に入っていった。



我今天玩儿得真高兴。
今日は楽しかった。



被他的大胆举动惊得目瞪口呆。
彼の大胆さにあ然とした。



对此，有必要进行大规模的调查。
それには大がかりな調査が必要だ。



根据实际情况加以解决。
実際の状況に基づいて解決する。



有关情况应该加以说明。
関連する事柄については説明すべきである。



他有困难，我们应给以帮助。
彼が困っているならわれわれは助けてやるべきだ。



她的厚颜无耻令人感到吃惊。
彼女の厚顔さには驚いた。



做这种事，连我自己都觉得丢脸。
こんなことをして，われながら恥ずかしい。



上午一直刮大风，过了中午风住了。
午前中はひどい風だったが，お昼過ぎになってやんだ。



外面下雨了。
外は雨降りだ。



星期天街上人非常多。
日曜日の町はたいした人出だ。



昨天从灾区回来的人都疲惫不堪。
昨日被災地から戻ってきた人々はみな疲れきった表情だった。



穿高跟鞋的夫人；
ハイヒールの奥さん。



戴墨镜的男人；
サングラスの男。



穿红裙子的少女。
赤いスカートの少女。